class AppConstants {
  // Marathi Content
  static const Map<String, String> marathiContent = {
    'title': 'पालकत्व मार्गदर्शक',
    'welcome': 'नर्सिंग कॉलेज विद्यार्थ्यांसाठी पालकत्व मार्गदर्शकात आपले स्वागत आहे!',
    'section1': '1. नर्सिंग स्कूलच्या मागण्या समजून घेणे:',
    'section1_content1': 'नर्सिंग शिक्षणाच्या कठोर स्वरूपाची आणि आवश्यक वेळेची वचनबद्धता जाणून घ्या.',
  };

  // Hindi Content
  // static const Map<String, String> hindiContent = {
  //   'title': 'पालकत्व मार्गदर्शक',
  //   'section5_content1': 'वित्तीय जिम्मेदारियों, जिसमें ट्यूशन, किताबें और कोई अतिरिक्त लागत शामिल हैं, पर चर्चा करें।',
  //   'section5_content2': 'नर्सिंग छात्रों के लिए छात्रवृत्ति के अवसरों का अन्वेषण करें।',
  //   'conclusion': 'याद रखें, प्रत्येक नर्सिंग छात्र की यात्रा अनूठी होती है, और उनकी सफलता में आपका समर्थन महत्वपूर्ण भूमिका निभाता है।',
  // };

  // Combined languages for multi-language support
  static const Map<String, String> languages = {
    'Hindi': 'हमारी एप्लीकेशन में आपका स्वागत है',
    'Marathi': 'आमच्या ॲप्लिकेशनमध्ये आपले स्वागत आहे',
    'Gujarati': 'અમારી એપ્લિકેશનમાં આપનું સ્વાગત છે',
    'Rajasthani': 'म्हारी एप्लीकेशन में थारो स्वागत है',
    'Telugu': 'మా అప్లికేషన్‌కు స్వాగతం',
    'Tamil': 'எங்கள் பயன்பாட்டிற்கு வரவேற்கிறோம்',
    'Punjabi': 'ਸਾਡੀ ਐਪਲੀਕੇਸ਼ਨ ਵਿੱਚ ਤੁਹਾਡਾ ਸੁਆਗਤ ਹੈ',
    'Bengali': 'আমাদের অ্যাপ্লিকেশনে আপনাকে স্বাগতম',
  };



  
  static const Map<String, String> hindiContent = {
    'title': 'पालकत्व मार्गदर्शक',
    'section5_content1': '''प्रमाण पत्र संख्या: ___________
दिनांक: ___ / ___ / ______

यह प्रमाणित किया जाता है कि श्री/श्रीमती/कुमारी ____________________ 
उम्र _____ वर्ष, निवासी __________________________ 
को दिनांक ___ / ___ / ______ से ___ / ___ / ______ तक 
बीमारी के कारण चिकित्सकीय परामर्श/उपचार की आवश्यकता थी।

उक्त अवधि में रोगी को पूर्ण विश्राम (Bed Rest) की सलाह दी गई है, 
अतः वह अपने कार्य/विद्यालय/महाविद्यालय में उपस्थित होने में 
असमर्थ थे/थीं।

अतः उन्हें ___ दिन का बीमारी अवकाश (Sick Leave) प्रदान किया जाना उचित है।

रोग/निदान (यदि आवश्यक हो): ____________________
विश्राम अवधि: ___ दिन

डॉक्टर का नाम: ____________________
पद: ____________________
पंजीकरण क्रमांक (Reg. No.): ____________________

हस्ताक्षर: ____________________
मुहर: ____________________
''',
    'section5_content2': ''' 
 

================ मराठी =================

शीर्षक: पालकत्व मार्गदर्शक

स्वागत:
नर्सिंग कॉलेज विद्यार्थ्यांसाठी पालकत्व मार्गदर्शकात आपले स्वागत आहे!

1. नर्सिंग स्कूलच्या मागण्या समजून घेणे:
- नर्सिंग शिक्षणाच्या कठोर स्वरूपाची आणि आवश्यक वेळेची जाणीव ठेवा.
- अभ्यासाच्या कठीण काळात पाठिंबा आणि प्रोत्साहन द्या.

2. आत्म-देखभाल प्रोत्साहित करा:
- शारीरिक व मानसिक आरोग्याचे महत्त्व समजावून सांगा.
- ताणतणावासाठी आरोग्यदायी उपाय सुचवा.

3. नैदानिक अनुभवांवर चर्चा करा:
- नैदानिक अनुभवांचा भावनिक परिणाम समजून घ्या.
- ऐकून घ्या आणि मार्गदर्शन करा.

4. नेटवर्किंग आणि व्यावसायिक विकास:
- नर्सिंग संघटना व कार्यक्रमांमध्ये सहभाग प्रोत्साहित करा.
- व्यावसायिक नेटवर्क तयार करण्याचे महत्त्व स्पष्ट करा.

5. आर्थिक विचार:
- शिक्षण शुल्क व इतर खर्चांवर चर्चा करा.
- शिष्यवृत्तीच्या संधी शोधा.

निष्कर्ष:
प्रत्येक नर्सिंग विद्यार्थ्याचा प्रवास वेगळा असतो आणि तुमचा पाठिंबा त्यांच्या यशासाठी महत्त्वाचा आहे.
 ''',
    'conclusion': ''' 
================ हिंदी =================

शीर्षक: पालन-पोषण मार्गदर्शिका

स्वागत:
नर्सिंग कॉलेज के छात्रों के लिए पालन-पोषण मार्गदर्शिका में आपका स्वागत है!

1. नर्सिंग स्कूल की मांगों को समझना:
- नर्सिंग शिक्षा की कठोर प्रकृति और आवश्यक समय प्रतिबद्धता से अवगत रहें।
- चुनौतीपूर्ण शैक्षणिक अवधियों के दौरान समर्थन और प्रोत्साहन प्रदान करें।

2. आत्म-देखभाल को प्रोत्साहित करें:
- शारीरिक और मानसिक कल्याण के महत्व पर जोर दें।
- तनाव और लंबे अध्ययन घंटों के लिए स्वस्थ मुकाबला तंत्र सुझाएं।

3. नैदानिक अनुभवों पर चर्चा करें:
- नैदानिक अनुभवों के भावनात्मक प्रभाव को समझें।
- भावनाओं को प्रबंधित करने के लिए ध्यानपूर्वक सुनें और मार्गदर्शन दें।

4. नेटवर्किंग और पेशेवर विकास का समर्थन करें:
- नर्सिंग संगठनों और कार्यक्रमों में भागीदारी को प्रोत्साहित करें।
- पेशेवर नेटवर्क बनाने के महत्व पर चर्चा करें।

5. वित्तीय विचार:
- शिक्षण शुल्क, किताबें और अन्य खर्चों पर चर्चा करें।
- छात्रवृत्ति के अवसरों का अन्वेषण करें।

निष्कर्ष:
प्रत्येक नर्सिंग छात्र की यात्रा अलग होती है और आपकी सहायता उनके लिए महत्वपूर्ण होती है।
 ''',
  };

  // Guide texts for PDF generation
  static const Map<String, Map<String, String>> guideTexts = {
    'English': {
      'title': 'Parenting Guide',
      'welcome': 'Welcome to the Parenting Guide for Nursing College Students!',
      'section1': '1. Understanding the Demands of Nursing School:',
      'section1_content1': 'Be aware of the rigorous nature of nursing education and the time commitment required.',
      'section1_content2': 'Offer support and encouragement during challenging academic periods.',
      'section2': '2. Encourage Self-Care:',
      'section2_content1': 'Emphasize the importance of physical and mental well-being.',
      'section2_content2': 'Suggest healthy coping mechanisms for stress and long study hours.',
      'section3': '3. Discuss Clinical Experiences:',
      'section3_content1': 'Understand the emotional impact of clinical experiences on your child.',
      'section3_content2': 'Provide a listening ear and share advice on managing emotions.',
      'section4': '4. Support Networking and Professional Development:',
      'section4_content1': 'Encourage participation in nursing organizations and events.',
      'section4_content2': 'Discuss the importance of building a professional network in the nursing field.',
      'section5': '5. Financial Considerations:',
      'section5_content1': 'Discuss financial responsibilities, including tuition, books, and any additional costs.',
      'section5_content2': 'Explore scholarship opportunities for nursing students.',
      'conclusion': 'Remember, each nursing student\'s journey is unique, and your support plays a crucial role in their success.',
    },
    'Hindi': {
      'title': 'पालन-पोषण मार्गदर्शिका',
      'welcome': 'नर्सिंग कॉलेज के छात्रों के लिए पालन-पोषण मार्गदर्शिका में आपका स्वागत है!',
      'section1': '1. नर्सिंग स्कूल की मांगों को समझना:',
      'section1_content1': 'नर्सिंग शिक्षा की कठोर प्रकृति और आवश्यक समय प्रतिबद्धता से अवगत रहें।',
      'section1_content2': 'चुनौतीपूर्ण शैक्षणिक अवधियों के दौरान समर्थन और प्रोत्साहन प्रदान करें।',
      'section2': '2. आत्म-देखभाल को प्रोत्साहित करें:',
      'section2_content1': 'शारीरिक और मानसिक कल्याण के महत्व पर जोर दें।',
      'section2_content2': 'तनाव और लंबे अध्ययन घंटों के लिए स्वस्थ मुकाबला तंत्र सुझाएं।',
      'section3': '3. नैदानिक अनुभवों पर चर्चा करें:',
      'section3_content1': 'अपने बच्चे पर नैदानिक अनुभवों के भावनात्मक प्रभाव को समझें।',
      'section3_content2': 'भावनाओं को प्रबंधित करने के लिए एक सूची और सलाह प्रदान करेंं।',
      'section4': '4. नेटवर्किंग और पेशेवर विकास का समर्थन करें:',
      'section4_content1': 'नर्सिंग संगठनों और कार्यक्रमों में भागीदारी को प्रोत्साहित करें।',
      'section4_content2': 'नर्सिंग क्षेत्र में एक पेशेवर नेटवर्क बनाने के महत्व पर चर्चा करें।',
      'section5': '5. वित्तीय विचार:',
      'section5_content1': 'वित्तीय जिम्मेदारियों, जिसमें ट्यूशन, किताबें और कोई अतिरिक्त लागत शामिल हैं, पर चर्चा करें।',
      'section5_content2': 'नर्सिंग छात्रों के लिए छात्रवृत्ति के अवसरों का अन्वेषण करें।',
      'conclusion': 'याद रखें, प्रत्येक नर्सिंग छात्र की यात्रा अनूठी होती है, और उनकी सफलता में आपका समर्थन महत्वपूर्ण भूमिका निभाता है।',
    },
    'Marathi': {
      'title': 'पालकत्व मार्गदर्शक',
      'welcome': 'नर्सिंग कॉलेज विद्यार्थ्यांसाठी पालकत्व मार्गदर्शकात आपले स्वागत आहे!',
      'section1': '1. नर्सिंग स्कूलच्या मागण्या समजून घेणे:',
      'section1_content1': 'नर्सिंग शिक्षणाच्या कठोर स्वरूपाची आणि आवश्यक वेळेची वचनबद्धता जाणून घ्या.',
      'section1_content2': 'नर्सिंग संघटना आणि कार्यक्रमांमध्ये सहभाग प्रोत्साहित करा.',
      'section2': '2. आत्म-देखभाल प्रोत्साहित करा:',
      'section2_content1': 'शारीरिक आणि मानसिक आरोग्याच्या महत्त्वावर जोर द्या.',
      'section2_content2': 'नर्सिंग संघटना आणि कार्यक्रमांमध्ये सहभाग प्रोत्साहित करा.',
      'section3': '3. नैदानिक अनुभवांवर चर्चा करा:',
      'section3_content1': 'तुमच्या मुलावर नैदानिक अनुभवांचा भावनिक परिणाम समजून घ्या.',
      'section3_content2': 'भावनांचे व्यवस्थापन करण्याबाबत ऐकण्याची यादी आणि सल्ला द्या.',
      'section4': '4. नेटवर्किंग आणि व्यावसायिक विकासाचे समर्थन करा:',
      'section4_content1': 'नर्सिंग संघटना आणि कार्यक्रमांमध्ये सहभाग प्रोत्साहित करा.',
      'section4_content2': 'नर्सिंग क्षेत्रात व्यावसायिक नेटवर्क तयार करण्याचे महत्त्व चर्चा करा.',
      'section5': '5. आर्थिक विचार:',
      'section5_content1': 'शिक्षण शुल्क, पुस्तके आणि कोणत्याही अतिरिक्त खर्चासह आर्थिक जबाबदाऱ्यांवर चर्चा करा.',
      'section5_content2': 'नर्सिंग विद्यार्थ्यांसाठी शिष्यवृत्तीच्या संधी शोधा.',
      'conclusion': 'लक्षात ठेवा, प्रत्येक नर्सिंग विद्यार्थ्यांचा प्रवास अद्वितीय असतो आणि त्यांच्या यशात तुमचा पाठिंबा महत्त्वपूर्ण भूमिका बजावतो.',
    },
  };
}
